GHB2/src/InformationRegisters/гхб_СобытияОбъектовБД/гхб_СобытияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СобытияОбъектовБД</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность</types>
      <types>DocumentRef.гхб_СвойстваПомещений</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПомещение</types>
      <types>DocumentRef.гхб_ЗакреплениеПомещенийЗаСотрудниками</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.гхб_ГруппыПомещений</types>
      <types>DocumentRef.гхб_РаспределениеДоступовВПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаЛокацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.гхб_ТипыСобытийОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СобытияОбъектовБД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанныеСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "", _Комментарий = "", _ДатаСобытия = Неопределено) Экспорт 
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = _СсылкаНаОбъект;
		Запись.ТипСобытия = _ТипСобытия;
		Запись.КлючСтроки = _КлючСтроки;
		Запись.ДатаСобытия = ?(_ДатаСобытия = Неопределено, гхб_ОбщегоНазначенияСервер.ВернутьВремяНаСервере(), _ДатаСобытия);
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Комментарий = _Комментарий;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		Запись.ДатаСобытия = ?(_ДатаСобытия = Неопределено, гхб_ОбщегоНазначенияСервер.ВернутьВремяНаСервере(), _ДатаСобытия);
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Комментарий = _Комментарий;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьДанныеСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт 
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);

	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СобытиеПоОбъектуБыло(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() <> 0;
	
КонецФункции

Функция ВернутьДатуСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Возврат ?(НаборЗаписей.Количество() <> 0, НаборЗаписей[0].ДатаСобытия, Дата(1, 1, 1));
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
